; ------------------------------------------------------------------------
; boot.asm
; ------------------------------------------------------------------------

; %define _BOOT_DEBUG_		; 做 Boot Sector 时一定要将此行注释掉！将此行打开后用 nasm Boot.asm -o Boot.com 做成一个 .COM 文件易于调试

%ifdef _BOOT_DEBUG_
	org 0100h			; 调试状态，做成 .COM 文件，可调试
%else
	org 07c00h			; Boot 状态， Bios 将把 Boot Sector 加载到 0:7C00 处并开始执行
%endif

; ------------------------------------------------------------------------
%ifdef _BOOT_DEBUG_
BaseOfStack equ 0100h		; 调试状态下的堆栈基地址（栈底，从这个位置向低地址生长）
%else
BaseOfStack equ 07c00h		; Boot 状态下的堆栈基地址（栈底，从这个位置向低地址生长）
%endif

%include "load.inc"
; ------------------------------------------------------------------------
